<PAD>
<UNK>
<EOS>
find
a
the
.
and
walk
table
left
turn
right
of
to
go
,
chair
stop
on
room
an
stairs
into
door
in
down
wait
through
at
bed
past
toilet
curtain
you
kitchen
lamp
towel
hallway
doorway
sink
mirror
couch
straight
sofa
exit
desk
picture
bedroom
tv
plant
counter
shelf
enter
dining
then
bathroom
shower
pillow
up
nightstand
with
paper
fireplace
box
coffee
your
bathtub
towards
end
take
front
pot
hall
bench
armchair
out
closet
can
trash
stand
forward
basin
stool
next
around
by
near
wash
refrigerator
head
first
doors
stove
bowl
dresser
continue
painting
machine
clothes
steps
photo
cushion
chairs
bottle
top
vase
glass
soap
area
until
make
book
there
once
ottoman
wardrobe
faucet
washing
wall
pass
outside
footstool
drawer
screen
island
oven
plate
open
that
bookshelf
two
shelves
pool
microwave
headboard
basket
round
fan
tissue
leave
rack
inside
pillar
across
vent
rod
side
statue
shelving
toward
office
just
living
bottom
flower
blanket
double
before
reach
when
fire
ahead
get
white
large
piano
between
from
staircase
step
dispenser
after
rail
fruit
speaker
blinds
railing
vanity
chest
set
second
printer
chandelier
way
bar
house
alarm
center
sculpture
laundry
telephone
passed
are
books
it
drawers
monitor
tree
dryer
case
air
toiletry
conditioner
is
wooden
thermostat
bucket
behind
rug
exercise
ladder
coat
bin
walking
going
entrance
container
cup
board
holder
sheet
candle
move
hangers
patio
towels
food
all
red
black
landing
toy
balcony
other
clock
small
keep
lounge
along
floor
dishwasher
computer
sitting
three
facing
corner
fence
again
middle
slight
smoke
teapot
slightly
heater
plants
another
passing
couches
stair
display
see
painter
blue
leading
sign
post
last
archway
guitar
switch
onto
window
bottles
clutter
follow
carpet
handle
detector
massage
furniture
long
extinguisher
range
hood
foot
globe
pan
radiator
doll
maker
entryway
bust
flowers
building
control
keyboard
will
wood
opening
few
lampshade
cloth
brown
dish
hard
tables
away
be
one
seat
tub
candlestick
brush
hat
plush
locker
face
directly
pedestal
place
stopping
treadmill
panel
proceed
using
this
ball
potted
sliding
hanger
far
beside
appliance
flight
equipment
dinner
ornament
windows
back
setting
where
decorative
walkway
urn
third
valence
opposite
'll
robe
main
umbrella
hose
as
commode
corridor
light
entry
weight
bike
curtains
green
bookcase
bulletin
veer
sharp
whiteboard
over
cross
under
porch
art
entering
scale
water
downstairs
bedpost
here
leads
purse
them
car
hamper
path
cabinet
swivel
degrees
stairwell
bag
dinning
's
boxes
storage
stairway
leather
utensils
stone
tray
marble
foyer
upstairs
''
mask
four
immediate
``
shampoo
knickknack
hanging
big
2
tile
immediately
beds
grey
grass
which
mat
figure
phone
base
television
shoes
easy
banister
more
empty
has
deck
climb
home
narrow
cabinets
showcase
stepping
garage
start
projector
wine
standing
paintings
very
so
're
elevator
decor
placemat
easel
off
edge
pictures
trinket
tap
metal
christmas
suitcase
weights
short
sinks
walls
halfway
arched
hand
above
heading
nearest
pillars
fridge
circle
theater
desks
cooler
bidet
have
closest
should
washer
yellow
feet
looking
turning
little
circular
some
framed
arch
stools
artwork
ridge
direction
exiting
about
taking
fourth
couple
stay
purple
rope
doorways
come
moving
column
indoors
though
five
cupboard
columns
striped
frame
but
threshold
gray
hot
spiral
gym
rest
reaching
travel
those
sets
via
brick
tall
benches
work
intersection
orange
descend
gate
fountain
bear
following
keeping
for
pantry
french
level
ping
pong
pews
do
partition
welcome
conference
bath
lobby
3
pink
ceiling
bookshelves
restroom
lockers
sauna
rocking
barricade
both
seating
gold
square
he
pathway
beige
dark
now
piece
half
need
reception
2nd
leftmost
quick
outdoor
study
silver
single
ascend
180
lead
flooring
wicker
(
)
destination
closed
ninety
master
suite
curved
elevators
dress
located
sofas
90
covered
've
says
library
farthest
divider
horse
concrete
space
mosaic
against
outdoors
soon
clear
iron
parallel
armchairs
reached
jacuzzi
look
row
game
arcade
aisle
staircases
not
oval
4
holes
switches
six
photos
till
finish
underneath
mirrors
alcove
ballroom
carpeted
adjacent
beyond
while
visible
upwards
tiled
drum
beach
entered
even
doormat
midway
close
each
platform
opens
exterior
garden
decoration
bit
floors
den
cellar
colored
marked
tapestry
fifth
hardwood
either
en
hammock
forwards
continuing
rocks
buffet
ground
u
meet
curve
ropes
turns
waiting
giant
prior
hit
dog
recliner
ovens
without
entire
arm
lower
these
rock
alongside
stones
animal
zebra
well
marilyn
church
or
rectangular
immediatly
shaped
further
degree
rightmost
smaller
abstract
railings
arrive
sixth
5
man
downwards
flights
grand
meeting
loft
chaise
almost
great
mirrored
women
beginning
length
utility
monroe
altar
line
same
runner
section
tot
breakfast
machines
built-in
family
let
sectional
diagonally
frames
part
upper
rooms
pillows
staying
tan
many
arches
lights
below
sidewalk
leaving
position
flag
labeled
seats
vases
wet
fitness
1
trees
n't
fancy
alter
velvet
roped
ornate
ends
curves
dots
larger
still
lattice
lamps
children
hang
containing
candles
45
counters
dressing
placed
planter
nook
host
arrow
stall
steel
furthest
locate
american
mini
men
drinking
passageway
panes
tiles
loungers
sconce
approach
poster
patterned
sailboat
posters
workout
feather
billiards
winding
armoire
wreath
angle
bigger
opened
upon
dogleg
credenza
beneath
'
countertop
pattern
veering
kitchenette
its
gravel
bush
pas
descending
clockwise
colorful
begin
;
only
cactus
recliners
goes
looks
infront
reading
checkered
no
wide
o'clock
barber
design
passage
thing
interior
bird
grill
curving
treadmills
screened
girl
making
statues
basketball
mats
bridal
court
climbing
entrances
getting
floral
grandfather
huge
decorations
dividers
rounded
frosted
plaque
movie
several
avoid
bedrooms
6
changes
built
froward
cupboards
console
loveseat
terrace
support
oriental
folding
view
garbage
like
copy
unicycle
lines
#
full
swimming
promptly
distance
our
bannister
also
stuffed
carpeting
pocket
night
flat
backyard
salon
filled
hallways
lighted
baskets
gallery
spa
pots
portrait
openings
old
walked
painted
sunset
stained
walk-in
saxophone
pivot
burgundy
banquet
ski
watermelon
foosball
cheetah
break
golden
ways
barrier
lit
jump
cream
dividing
doorknob
rectangle
written
formal
nest
central
granite
love
recreation
cushioned
bushes
indoor
skin
areas
paneled
planters
4th
pipes
u-turn
downward
faced
guardrail
rows
boulders
structure
cylindrical
stainless
cylinder
stars
object
overlooking
pair
curio
fake
mounted
swing
deer
archways
remaining
cases
handing
entertainment
arc
were
3rd
extreme
pause
suitcases
lady
net
pendant
ship
unit
barstools
barn
talk
low
int
sit
pole
palm
11
homes
pgi
restrooms
giraffe
print
cow
enerskin
washer/dryer
splits
stanchions
final
run
grated
eight
...
started
surrounded
followed
use
kitchen/living
paces
branch
finally
yourself
breezeway
th
boiler
walks
seven
massive
roof
stacked
pew
dot
nearby
billiard
woven
makeup
tops
gone
entranceway
ledge
pallet
impact
hub
tennis
ping-pong
word
made
signs
everything
background
reclining
please
showers
instructions
wastebasket
reenter
atrium
chrome
media
extremely
put
arrangement
flowerbed
closets
checkerboard
mantle
if
plaid
posts
pieces
holding
wheelchair
ladies
current
fixtures
throught
brass
really
hexagon
horizontal
circles
shop
rice
bay
crossing
bathrooms
diagonal
stalls
enters
screens
guitars
bunch
washroom
playroom
arrived
than
instead
pulp
fiction
photographs
twin
split
fork
houseplant
crab
thought
stepped
stationary
image
hundred
eighty
lounging
mural
rights
labelled
twelve
o
block
security
barred
settee
lefts
vertical
stools/chairs
cushions
t
tusks
change
vaulted
any
bouquet
trunk
rugs
guest
son
division
shoe
backgammon
popcorn
starting
tablecloth
elliptical
zebras
einstein
pulpit
enclosed
02
number
offices
meets
finished
fireplaces
siting
crystal
spot
does
beautiful
extinguishers
semi
chandeliers
wrap
weird
odd-shaped
showing
arms
padded
hedges
petition
reverse
boards
solid
their
text
group
able
prints
exist
teh
aright
kids
moment
having
strip
thin
too
ceramic
similar
lake
cowhide
indoor/outdoor
couches.walk
doorstep
street
lips
geometric
stairs.make
stool/chairs
room.turn
e
flowered
pane
awning
navigate
driveway
degress
bananas
class
buildings
begins
stiars
wall-mounted
exits
crossed
cinema
trieste
projection
aside
blackboard
sides
trashcan
easle
sharply
rolls
copier
bins
cacti
appliances
dirt
direclty
metallic
handrail
reddish
-
barbeque
fixture
cement
birdcage
sing
hallway.walk
chessboard
mantel
high
hutch
banisters
native
plaques
teddy
say
approximately
longer
chimney
gilt
grain
forty-five
faucets
lots
handles
extra
tubs
plates
robes
minibar
attached
sculptures
woman
bathing
receptionist
bamboo
walled
inset
decorated
outlet
done
vine
strait
hollow
station
vending
left.turn
adjoining
wooden/glass
hangings
river
tiling
tank
contains
paneling
drums
pine
coach
drumset
got
plan
goo
collection
boat
theatre
letters
bbq
person
motion
seventh
perfume
remainder
available
squared
units
triptych
lighting
160
diamond
lounger
left-hand
radio
sop
tea
curtained
bedroom.turn
scenes
canisters
people
style
comforter
bars
grate
quickly
most
triangle
ones
shallow
liquor
pig
hug
daybed
til
tun
mermaid
centerpiece
throw
darker
chars
upholstered
wrought
right.go
niche
leaf
ten
backside
shag
right.turn
leaves
pit
human
perpendicular
rear
beam
onward
thirty
chevron
rails
minifridge
zigzag
intersecting
plastic
bags
cars
nice
barroom
buddha
remain
ro
ascending
11th
antechamber
panels
anymore
bicycle
video
hockey
point
camera
traveling
pavement
urinal
arriving
upward
trapdoor
workbench
attic
tiny
dishes
butler
goal
may
hyena
pointed
star
antelope
orchids
sword
wheel
wing
transparent
breaker
polka
opp
vessel
guitarist
organ
stage
maroon
baptismal
graphic
spaces
339
yard
carts
stairs.then
stairwells
hold
fainting
table.wait
rope.turn
candelabra
hallway.stop
k
gazing
chandileir
met
reg
passes
backed
intersects
throuhg
victorian
roped-off
bring
rose
glasstop
latticework
lighter
slabs
inbetween
blonde
glass-topped
holders
ironing
televisions
topped
switch-plate
oddly
turn.go
prayer
hole
ensuite
stoves
tablet
shirts
bearing
bumping
plug-in
mid-point
photographic
boys
words
couches.pass
cutout
doorsways
writing
bedroom.take
'e
straight.then
room..near
self
kitchen/bar
outside.go
dock
chess
orient
grained
herringbone
combination
watch
ding
proper
outdoor/indoor
wal
halls
mirror/sink
walkout
couche/chairs.wait
wetbar
hearing
nesxt
cabin
found
soldier
lap
oak
wallpaper
withe
wall.turn
tenth
fern
flanked
murphy
knights
ivy
feeding
cardboard
bistro
wing-backed
bad
chair/couches
closes
andgo
nect
stairs..
chesterfield
classdoors
model
steping
continiue
sleeping
sections
bedroomon
viewing
mark
ash
lacquer
touch
chalkboard
table-tennis
things
sticking
posted
magazine
laptop
displace
imac
photocopier
macine
wiat
crate
tale
supports
intersect
vase-like
downtown
pins
pail
floor-length
bookcases
pinball
workroom
chaises
pool.then
inter
meter
triangular
splash
reflective
discontinue
momentum
halt
slate
narrows
boulder
blackened
modern
fireplace.make
grilling
ext
separate
fives
outside.walk
wading
semicircular
aluminum
around.and
outhouse
heart
landscape
lawn
double-doors.go
goright
wingback
sheets
end-table
opnes
poodle
merge
gong
boats
overhang
overlooks
harbor
mountain
abe
lincoln
buck
pelts
safair
elevator..
fish
door.go
avove
patchwork
frontier
quilted
handicap
doors.walk
fishing
handicapped
treasure
timber
hardware
carriage
bahtroom
paisley
accessible
moose
snowman
quilt
stairways
piller
waitin
showroom
table.stop
unto
doubles
rightward
ours
color
triangle-shaped
coming
briefly
step.take
pedestals
upstairs.go
cake
table..
warmer
item
pallets
bathtubs
bed.the
alcoholic
drinks
dark-brown
glowing
right.walk
nerolie
medical
'thalgo
bed-like
structures
bating
thru
slowly
came
135
10
procedure
metre
lioness
xray
mens
heads
connected
previous
left..
common
identical
portraits
tanning
wand
shape
products
containers
donut
jaunt
bathtub-like
apples
urns
snack
dispense
hampers
fountains
x-ray
device
beverage
filter
liquid
dispensing
pans
lined
unfinished
pump
kitchen.and
onc
eyou
plain
six-drawer
clothing
kit
towars
20
washbasin
shiplapped
chalk
musical
instruments.turn
bedside
instrument
groom
soft
sail
poem
drawing
clasping
her
chin
kidney
sconces
taker
metres
fireplace.stop
intercom
exited
windowed
decorating
pegs
elephant
george
harrison
quote
spider-man
two-bed
ventilation
conitnue
ont
rigvht.go
seeing
se
beverages
await
instruction
shapes
7
tiered
glass-enclosed
'zebra
read
continued
three-quarters
wraparound
opportunity
countertops
twp
l
chance
ac
chartreuse
conditioning
double-doors
caution
beauty
half-wall
parttion
could
?
latticed
barbers
bathroomand
bathroom.walk
soyunma
odasi
sink.s
mental
crash-bar
bikes
sized
slippers
soaps
turk
hamami
dim
straight.exit
stretched
adjustable
kettle
'city
label
city
sill
encounter
armchairs.turn
chritmas
nativity
scene
brochures
brick-laid
road
bricks
setee
siairs
tree.on
reads
chair/sofa
ocean
garment
bast
greenish
paste
residence
kid
rabbit
ears
hear
buiding
store
circle-shaped
cut
outs
covering
location
ottomans
ready
body
colorless
headed
electrical
comprised
turned
curious
duvet
fully
child
knob
room.walk
charis
asking
blocking
endter
lime
wooden-floored
trying
gown
yoou
stairs.walk
club
audiovisual
completely
chair/stools
arching
bathroom.turn
triple
left.continue
midpoint
encased
mid
drawn
transom
clothed
tabled
music
instructed
counting
enterence
left.stop
departed
floor-to-ceiling
80
blackets
swith
raised
plunge
sky
doors.stop
was
requires
allow
teal
panting
cabana
poolside
dancer
ninth
twelfth
waterfall
faux
orchid
skylight
platter
orientation
amazing
sunning
room/kitchen
30
bedroom.once
bypassing
dooway
stump
t.v
rooom
splatter
stairs.when
bodega
fron
gain
lounges
patio.wait
progress
complete
wired
lying
vertices
ar
wards
stairs.wait
outside.wait
woodside
kitchen/dinning
feathers
went
earlier
lightswitches
mini-fridge
dartboard
whole
stripes
spell
skis
nine
stuff
various
wires
soaking
spray
booth
golf
vineyard
farm
overhead
rightside
office.take
lighthouse
entryways
draped
spherical
dollhouse
walkdown
doorframe
criss
billard
heavy
ring
trophy
mostly
displaying
glassware
sunken
they
indian
check
bye
skateboards
door..
jars
taupe
riest
admire
straight.take
crooked
plate-like
disk
endtable
warning
tape
danger
peligro
6th
curly
dining/library
birdhouse
press
barrel
molded
thew
kitchen.go
stands
dressers
topiaries
paved
rowing
right.stop
kiddie
shrubs
whose
stairs.move
paving
drawings
overstuffed
room.stop
route
butter
churns
traverse
advance
order
exactly
bu
room/living
barbecue
nude
entrence
overlook
shortly
thorough
northernmost
dual
marble-topped
veranda
charcoal
set.turn
pastt
frida
kahlo
painting.walk
drapery
ca
runs
bypass
wolverine
stops
funky
cordless
dinette
basement
table/desk
plug
slats
highchairs
log
bridge
whirlpool
different
cafe
cooker
bathroom.stop
original
forward.turn
netting
la-z-boy
raw
pac-man
lot
agian
room.stand
match
lightswitch
placemats
junction
table.take
tucked
narrower
honeycomb
passe
feature
sharper
dinging
glass/wood
underside
linens
cloths
bench..
gazebo
patio.turn
beamed
trusses
urinals
hands
service
serving
foundation
careful
wake
pasr
shades
studio
enterance
appears
den/living
workspace
workshop
nextt
crossroads
stet
ste
frojt
rung
additional
twice
right.then
striaght
wooded
wat
doorway.walk
ad
champagne
enough
kitch
opending
staits
yoga
corners
op
left.stay
larch
powder
leeds
steps.turn
twenty
pillared
mud
david
motorcycle
starts
animals
branches
hoop
fresh
bare
walkthrough
would
fire-pit
table.go
slot
however
travertine
pavers
shining
fooseball
closer
libray
wildlife
copper
border
bordered
slighting
backless
scarf
handside
marle
smiling
recessed
quarter
leopard
least
ithrough
lilacs
birds
floored
mirror.take
cupboard.take
printed
.walk
peice
table.walk
midle
separates
intermediary
loveseats
wagon
see-through
skinny
because
stairs.go
stairs.
digital
char
5th
canvas
conversational
fossilized
stairs.turn
tol
distressed
footrest
fur
supplies
cookie
jar
doorwaya
nd
drop
construction
materials
proceeding
etc
shy
power
system
right.after
atnd
slender
vertically
nature
foward
cables
picnic
dotted
paris
my
dreams
refirgerator
ak47
guy
neck
t-shirts
ryan
blair
la
player
oft
plank
skull
jimmy
hendrix
thr
faces
blankets
dead
leg
mauve
divides
graphite
continute
isle
titled
missa
cantata
john
coburn
daniel
oustide
turnstyle
placard
throne
carved
font
in-ground
pond
larg
locked
town
except
ope
redefine
how
pipe
314
sun
bicycles
cubical
cubicles
doing
376
go.then
04
5-e
5-d
t.
314.
363.
s-c
360
359
307
al
new
business
opportunities
walkway..
kitty-corner
344
tees
01.
classroom
308.
what
numerous
slat
patch
tub.go
bonsais
steppingstones
hot-tub
planks
shrubbery
bank
.go
luggage
stored
lengths
restaurant
becomes
magazines
revolving
parlor
staff
management
hallwy
partitions
parking
houses
enclosure
electric
possible
hotel
rocker
door.take
higher
lefthand
bookshelft
thats
statute
snail
patio.stop
canter
llama
lane
religious
figures
kneeling
